lvx/base/Catalogs/ПланыСчетовМеждународногоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПланыСчетовМеждународногоУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетВФункциональнойВалюте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВФункциональнойВалюте</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПредставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормированияПроводок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормированияПроводок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводкиБезКорреспонденции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводкиСКорреспонденцией</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУчетаНесобственныхПодконтрольныхЦенностей</Name>
					<Comment>Способ учета ценностей, контролируемых организацией, но не принадлежащих ей</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНесобственныхПодконтрольныхЦенностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПредставлениеСчетовМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/ПланыСчетовМеждународногоУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Если используется один план счетов, то возвращается ссылка на него.
// Если несколько, то возвращается пустая ссылка.
// 
// Возвращаемое значение:
// 	СправочникСсылка.ПланыСчетовМеждународногоУчета - 
Функция ПланСчетовПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ПланыСчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПланыСчетовМеждународногоУчета КАК ПланыСчетов
	|ГДЕ
	|	НЕ ПланыСчетов.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Количество = Выборка.Количество();
	Если Количество = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ПланыСчетовМеждународногоУчета.ПустаяСсылка();
	
КонецФункции

// Возвращает планы счетов, по которым проводки формируются с корреспонденцией
// 
// Возвращаемое значение:
// 	СписокЗначений - 
Функция ПланСчетовСПроводкамиСКорреспонденцией() Экспорт
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыСчетов.Ссылка КАК Ссылка,
	|	ПланыСчетов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПланыСчетовМеждународногоУчета КАК ПланыСчетов
	|ГДЕ
	|	НЕ ПланыСчетов.ПометкаУдаления
	|	И ПланыСчетов.ВариантФормированияПроводок = ЗНАЧЕНИЕ(Перечисление.ВариантыФормированияПроводок.СКорреспонденцией)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Доступен учет в валюте упр.
// 
// Возвращаемое значение:
//  Булево - Доступен учет в валюте упр
Функция ДоступенУчетВВалютеУпр() Экспорт
	
	ДоступенУчетВВалютеУпр = Истина;
	Если НЕ ПолучитьФункциональнуюОпцию("ПроводкиМеждународногоУчетаПоДаннымОперативного")
 		И ПолучитьФункциональнуюОпцию("ФормироватьПроводкиМеждународногоУчетаПоДаннымРегламентированного")
		И НЕ ПолучитьФункциональнуюОпцию("ВестиУУНаПланеСчетовХозрасчетный") Тогда
		ДоступенУчетВВалютеУпр = Ложь;	
	КонецЕсли;
	
	Возврат ДоступенУчетВВалютеУпр;
	
КонецФункции

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника.
//  ТабличныеЧасти - Структура - Ключ - Имя табличной части объекта.
//                               Значение - Выгрузка в таблицу значений пустой табличной части.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	#Область Международный
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Международный";
	Элемент.Наименование = НСтр("ru = 'Международный';
								|en = 'Financial'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.УчетВФункциональнойВалюте = Перечисления.ВидыУчетаВФункциональнойВалюте.ВВалютеРегл;
	Элемент.ВалютаПредставления = Константы.ВалютаУправленческогоУчета.Получить();
	Элемент.СпособУчетаНесобственныхПодконтрольныхЦенностей = Перечисления.СпособыУчетаНесобственныхПодконтрольныхЦенностей.НеОтражаютсяНаСчетах;
	Элемент.ПредставлениеСчетов = Перечисления.ПредставлениеСчетовМеждународногоУчета.ВВидеКодаИНаименования;
	Если ПолучитьФункциональнуюОпцию("ЛокализацияРФ") Тогда
		Элемент.ВариантФормированияПроводок = Перечисления.ВариантыФормированияПроводок.СКорреспонденцией;
		Элемент.ПроводкиБезКорреспонденции = Ложь;
		Элемент.ПроводкиСКорреспонденцией = Истина;
	Иначе
		Элемент.ВариантФормированияПроводок = Перечисления.ВариантыФормированияПроводок.БезКорреспонденции;
		Элемент.ПроводкиБезКорреспонденции = Истина;
		Элемент.ПроводкиСКорреспонденцией = Ложь;
	КонецЕсли;
	#КонецОбласти

КонецПроцедуры

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
//
// Возвращаемое значение:
//	Массив Из Строка - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	БлокируемыеРеквизиты.Добавить("УчетВФункциональнойВалюте;УчетВФункциональнойВалюте");
	БлокируемыеРеквизиты.Добавить("ВалютаПредставления;ВалютаПредставления");
	БлокируемыеРеквизиты.Добавить("ВариантФормированияПроводок;ВариантФормированияПроводок");
	БлокируемыеРеквизиты.Добавить("СпособУчетаНесобственныхПодконтрольныхЦенностей;СпособУчетаНесобственныхПодконтрольныхЦенностей");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура СоздатьМеждународныйПланСчетовПервыйЗапуск() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ПланыСчетовМеждународногоУчета");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Международный);
		Блокировка.Заблокировать();
		
		МеждународныйПланСчетов = Международный.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(МеждународныйПланСчетов.Наименование) Тогда
			МеждународныйПланСчетов.Наименование = НСтр("ru = 'Международный';
														|en = 'Financial'", ОбщегоНазначения.КодОсновногоЯзыка()); // строка записывается в ИБ
			МеждународныйПланСчетов.УчетВФункциональнойВалюте = Перечисления.ВидыУчетаВФункциональнойВалюте.ВВалютеРегл;
			МеждународныйПланСчетов.СпособУчетаНесобственныхПодконтрольныхЦенностей = Перечисления.СпособыУчетаНесобственныхПодконтрольныхЦенностей.НеОтражаютсяНаСчетах;
			МеждународныйПланСчетов.ПредставлениеСчетов = Перечисления.ПредставлениеСчетовМеждународногоУчета.ВВидеКодаИНаименования;
			МеждународныйПланСчетов.ВариантФормированияПроводок = Перечисления.ВариантыФормированияПроводок.СКорреспонденцией;
			МеждународныйПланСчетов.ПроводкиСКорреспонденцией = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(МеждународныйПланСчетов);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
